Tekla Open API Reference for Tekla Structures 2025
Operation.SaveAsWebModel Method
 Saves the current model as a web model.
You can save the model as a web model that can be viewed via the Internet using a web browser (e.g. Internet Explorer).
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SaveAsWebModel(
	string Filename
)
Public Shared Function SaveAsWebModel (
	Filename As String
) As Boolean
Parameters
Filename
Type: System.String
The filename to be used.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace